DOE_5/run6/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 0.001;

vertices
(
    // Untere Ebene z = 0
    (-15 -0.5  0)   // 0
    (-15  0.5  0)   // 1
    ( 15  0.5  0)   // 2
    ( 15 -0.5  0)   // 3

    // Obere Ebene z = 15
    (-15 -0.5 15)   // 4
    (-15  0.5 15)   // 5
    ( 15  0.5 15)   // 6
    ( 15 -0.5 15)   // 7
);

blocks
(
    hex (0 3 2 1 4 7 6 5) (250 1 250) simpleGrading (1 1 5)
);

boundary
(
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)   // z = 0
        );
    }

    top
    {
        type patch;     // oder wall, wie du willst
        faces
        (
            (4 5 6 7)   // z = 30
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 1 5 4)   // x = -15
        );
    }

    right
    {
        type wall;
        faces
        (
            (3 7 6 2)   // x = +15  (Reihenfolge ok so)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 4 7 3)   // y = -0.5
        );
    }

    back
    {
        type empty;
        faces
        (
            (1 2 6 5)   // y = +0.5
        );
    }
);